#include <stdio.h>
#include <locale.h>

void task1();
void task2();
void task3();

int main() {

	// Кодировка
	setlocale(LC_ALL, ".UTF-8");

	// Задачи
	task1();
	task2();
	task3();

	return 0;
}

void task1() {

	// Подзадача 1
	char c = '!';
	int i = 2;
	float f = 3.14;
	double d = 5e-1;

	//// Подзадача 3
	//puts("Введите значения для переменных типа char, int, float, double соответственно:\n");
	//scanf("%c %d %.f %lf", &c, &i, &f, &d);
	// Подзадача 2
	puts("Значения переменных:");
	printf("char: %c\nint: %d\nfloat: %4.2f\ndouble: %lf\n\n", c, i, f, d);

	// Подзадача 3
	puts("Введите значения для переменных типа char, int, float, double соответственно:");
	scanf("%c %d %f %lf", &c, &i, &f, &d);

	// Подзадача 1а
	printf("Целая часть первого вещественного числа: %.0f\n", f);
	int new = f;
	printf("Дробная часть первого вещественного числа: %f\n", f - new);

	// Подзадача 1б
	printf("Шестнадцатеричный код символа: %x\n", c);
	printf("Десятичный код введенного символа: %d\n", c);

	// Подзадача 1в
	printf("Десятичное число для 1/%d: %f\n", i, 1. / i);

}

void task2() {
	// Подзадача 1
	int a = 11;
	int b = 3;

	// Подзадача 2
	int x;
	float y;
	double z;

	// Подзадача 3
	x = a / b;
	y = a / b;
	z = a / b;

	// Подзадача 4
	printf("x: %d\ny: %f\nz: %lf\n", x, y, z);

	// Подзадача 5
	/* Тк у "x" тип данных int, дробная часть обрезается и записывается целая часть */
	/* Тк у "y" тип данных float, дробная часть выводится вместе с целой, так же и с "z" */

	// Подзадача 6
	printf("x: %d\ny: %f\nz: %lf\n", a / b, (float)a / b, (double)a / b);

	/* Тк у "a" и "b" тип данных остался int, в результате дробная часть обрезается и записывается целая часть */
	/* Тк у "a" тип данных явно преобразован во float, дробная часть выводится вместе с целой, так же и с явным преобразованием "a" в double */
}

void task3() {
	// Подзадача 1
	int n;

	// Подзадача 2
	puts("Введите целое трехначное число");
	scanf("%d", &n);

	// Подзадачи 3, 4
	printf("Последняя цифра - %d, первая цифра - %d, сумма цифр - %d\n",
		n % 10, n / 100, n % 10 + n / 100 + n / 10 % 10);
}